{
    "batch_size": 128, 
    "class_name": "Model", 
    "config": {
        "input_layers": [
            [
                "input", 
                0, 
                0
            ]
        ], 
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "batch_input_shape": [
                        null, 
                        3, 
                        32, 
                        32
                    ], 
                    "input_dtype": "float32", 
                    "name": "input", 
                    "sparse": false
                }, 
                "inbound_nodes": [], 
                "name": "input"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_1", 
                    "nb_col": 3, 
                    "nb_filter": 32, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_1"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_1", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_1"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_2", 
                    "nb_col": 3, 
                    "nb_filter": 32, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_2"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_2", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_2"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "border_mode": "valid", 
                    "dim_ordering": "th", 
                    "name": "maxpooling2d_1", 
                    "pool_size": [
                        2, 
                        2
                    ], 
                    "strides": [
                        2, 
                        2
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "maxpooling2d_1"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "name": "dropout_1", 
                    "p": 0.25, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "maxpooling2d_1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dropout_1"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_3", 
                    "nb_col": 3, 
                    "nb_filter": 64, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dropout_1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_3"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_3", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_3"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_4", 
                    "nb_col": 3, 
                    "nb_filter": 64, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_4"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_4", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_4", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_4"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "border_mode": "valid", 
                    "dim_ordering": "th", 
                    "name": "maxpooling2d_2", 
                    "pool_size": [
                        2, 
                        2
                    ], 
                    "strides": [
                        2, 
                        2
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_4", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "maxpooling2d_2"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "name": "dropout_2", 
                    "p": 0.25, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "maxpooling2d_2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dropout_2"
            }, 
            {
                "class_name": "Flatten", 
                "config": {
                    "name": "flatten_1", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dropout_2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "flatten_1"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": null, 
                    "activation": "relu", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "init": "glorot_uniform", 
                    "input_dim": null, 
                    "name": "dense_1", 
                    "output_dim": 512, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "flatten_1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dense_1"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": null, 
                    "activation": "softmax", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "init": "glorot_uniform", 
                    "input_dim": null, 
                    "name": "dense_2", 
                    "output_dim": 10, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dense_1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dense_2"
            }
        ], 
        "name": "CNN", 
        "output_layers": [
            [
                "dense_2", 
                0, 
                0
            ]
        ]
    }, 
    "experiment_name": "Eve", 
    "img_dim": [
        3, 
        32, 
        32
    ], 
    "keras_version": "1.1.0", 
    "nb_epoch": 200, 
    "optimizer": {
        "beta_1": 0.8999999761581421, 
        "beta_2": 0.9990000128746033, 
        "beta_3": 0.9990000128746033, 
        "big_K": 10.0, 
        "epsilon": 1e-08, 
        "lr": 0.0010000000474974513, 
        "small_k": 0.10000000149011612
    }, 
    "train_accs": [
        [
            0.43915999999999999
        ], 
        [
            0.62173999999999996
        ], 
        [
            0.68998000000000004
        ], 
        [
            0.73197999998092655
        ], 
        [
            0.76109999998092648
        ], 
        [
            0.77681999999999995
        ], 
        [
            0.79525999996185304
        ], 
        [
            0.80788000003814697
        ], 
        [
            0.82368000003814701
        ], 
        [
            0.84447999996185308
        ], 
        [
            0.86098000003814701
        ], 
        [
            0.874039999961853
        ], 
        [
            0.89980000000000004
        ], 
        [
            0.91343999996185299
        ], 
        [
            0.92267999996185301
        ], 
        [
            0.94082000001907351
        ], 
        [
            0.94482000003814692
        ], 
        [
            0.95084000001907354
        ], 
        [
            0.96135999998092647
        ], 
        [
            0.96864000001907347
        ], 
        [
            0.97463999996185302
        ], 
        [
            0.97888000003814701
        ], 
        [
            0.98051999999999995
        ], 
        [
            0.98267999996185307
        ], 
        [
            0.98470000001907354
        ], 
        [
            0.98604000000000003
        ], 
        [
            0.98716000003814697
        ], 
        [
            0.98850000000000005
        ], 
        [
            0.98919999999999997
        ], 
        [
            0.99022000001907351
        ], 
        [
            0.99036000003814695
        ], 
        [
            0.99048000000000003
        ], 
        [
            0.99060000003814697
        ], 
        [
            0.99185999999999996
        ], 
        [
            0.99185999999999996
        ], 
        [
            0.99172000000000005
        ], 
        [
            0.99248000000000003
        ], 
        [
            0.99272000001907346
        ], 
        [
            0.99246000000000001
        ], 
        [
            0.99220000001907349
        ], 
        [
            0.99350000000000005
        ], 
        [
            0.99338000000000004
        ], 
        [
            0.99364000001907349
        ], 
        [
            0.99375999999999998
        ], 
        [
            0.99446000001907353
        ], 
        [
            0.99399999999999999
        ], 
        [
            0.99372000000000005
        ], 
        [
            0.99443999999999999
        ], 
        [
            0.99520000001907349
        ], 
        [
            0.99497999999999998
        ], 
        [
            0.99472000000000005
        ], 
        [
            0.99441999999999997
        ], 
        [
            0.99553999999999998
        ], 
        [
            0.99517999999999995
        ], 
        [
            0.99565999999999999
        ], 
        [
            0.99561999999999995
        ], 
        [
            0.99560000000000004
        ], 
        [
            0.99550000001907346
        ], 
        [
            0.996
        ], 
        [
            0.99468000000000001
        ], 
        [
            0.99543999999999999
        ], 
        [
            0.99546000000000001
        ], 
        [
            0.9953200000190735
        ], 
        [
            0.99539999999999995
        ], 
        [
            0.99639999999999995
        ], 
        [
            0.99578
        ], 
        [
            0.99631999999999998
        ], 
        [
            0.99595999999999996
        ], 
        [
            0.99714000003814696
        ], 
        [
            0.99590000000000001
        ], 
        [
            0.99590000001907353
        ], 
        [
            0.99646000000000001
        ], 
        [
            0.99626000000000003
        ], 
        [
            0.99616000000000005
        ], 
        [
            0.99594000000000005
        ], 
        [
            0.99624000000000001
        ], 
        [
            0.99665999999999999
        ], 
        [
            0.99597999999999998
        ], 
        [
            0.99641999999999997
        ], 
        [
            0.99621999999999999
        ], 
        [
            0.99665999999999999
        ], 
        [
            0.99675999999999998
        ], 
        [
            0.99641999999999997
        ], 
        [
            0.99614000001907343
        ], 
        [
            0.99675999999999998
        ], 
        [
            0.99736000001907343
        ], 
        [
            0.99672000001907346
        ], 
        [
            0.99672000000000005
        ], 
        [
            0.99704000000000004
        ], 
        [
            0.99634
        ], 
        [
            0.99678
        ], 
        [
            0.9963200000190735
        ], 
        [
            0.99663999999999997
        ], 
        [
            0.99743999999999999
        ], 
        [
            0.99660000000000004
        ], 
        [
            0.99687999999999999
        ], 
        [
            0.99716000000000005
        ], 
        [
            0.99712000000000001
        ], 
        [
            0.99685999999999997
        ], 
        [
            0.99712000000000001
        ], 
        [
            0.99760000000000004
        ], 
        [
            0.99731999999999998
        ], 
        [
            0.99738000000000004
        ], 
        [
            0.99678
        ], 
        [
            0.99717999999999996
        ], 
        [
            0.99697999999999998
        ], 
        [
            0.99668000000000001
        ], 
        [
            0.99736000001907343
        ], 
        [
            0.99716000000000005
        ], 
        [
            0.99731999999999998
        ], 
        [
            0.99752000001907348
        ], 
        [
            0.99738000000000004
        ], 
        [
            0.99722000001907352
        ], 
        [
            0.99728000000000006
        ], 
        [
            0.99773999999999996
        ], 
        [
            0.99790000000000001
        ], 
        [
            0.99739999999999995
        ], 
        [
            0.99738000000000004
        ], 
        [
            0.99726000000000004
        ], 
        [
            0.99722000001907352
        ], 
        [
            0.99728000000000006
        ], 
        [
            0.99768000000000001
        ], 
        [
            0.99734
        ], 
        [
            0.99748000000000003
        ], 
        [
            0.99768000000000001
        ], 
        [
            0.99761999999999995
        ], 
        [
            0.99758000000000002
        ], 
        [
            0.99772000000000005
        ], 
        [
            0.99761999999999995
        ], 
        [
            0.99804000000000004
        ], 
        [
            0.99760000003814697
        ], 
        [
            0.99717999999999996
        ], 
        [
            0.99753999999999998
        ], 
        [
            0.99802000000000002
        ], 
        [
            0.99750000000000005
        ], 
        [
            0.99802000000000002
        ], 
        [
            0.99762000001907347
        ], 
        [
            0.99804000000000004
        ], 
        [
            0.99702000001907354
        ], 
        [
            0.99756000001907352
        ], 
        [
            0.99748000000000003
        ], 
        [
            0.99751999999999996
        ], 
        [
            0.99770000000000003
        ], 
        [
            0.99773999999999996
        ], 
        [
            0.99746000000000001
        ], 
        [
            0.99790000001907353
        ], 
        [
            0.99760000001907345
        ], 
        [
            0.99775999999999998
        ], 
        [
            0.99780000000000002
        ], 
        [
            0.99802000000000002
        ], 
        [
            0.99786000001907349
        ], 
        [
            0.99751999999999996
        ], 
        [
            0.99809999999999999
        ], 
        [
            0.99778000001907352
        ], 
        [
            0.99787999999999999
        ], 
        [
            0.99812000000000001
        ], 
        [
            0.99814000000000003
        ], 
        [
            0.99794000000000005
        ], 
        [
            0.99807999999999997
        ], 
        [
            0.99756000001907352
        ], 
        [
            0.99804000000000004
        ], 
        [
            0.99783999999999995
        ], 
        [
            0.99787999999999999
        ], 
        [
            0.99816000000000005
        ], 
        [
            0.99818000001907348
        ], 
        [
            0.99761999999999995
        ], 
        [
            0.99763999999999997
        ], 
        [
            0.99809999999999999
        ], 
        [
            0.99807999999999997
        ], 
        [
            0.99797999999999998
        ], 
        [
            0.99817999999999996
        ], 
        [
            0.99812000000000001
        ], 
        [
            0.99782000000000004
        ], 
        [
            0.99782000000000004
        ], 
        [
            0.99802000000000002
        ], 
        [
            0.99783999999999995
        ], 
        [
            0.99787999999999999
        ], 
        [
            0.99797999999999998
        ], 
        [
            0.99807999999999997
        ], 
        [
            0.99782000000000004
        ], 
        [
            0.99802000000000002
        ], 
        [
            0.99816000000000005
        ], 
        [
            0.99802000000000002
        ], 
        [
            0.99797999999999998
        ], 
        [
            0.99795999999999996
        ], 
        [
            0.99783999999999995
        ], 
        [
            0.99819999999999998
        ], 
        [
            0.99818000001907348
        ], 
        [
            0.99812000001907353
        ], 
        [
            0.99824000000000002
        ], 
        [
            0.99817999999999996
        ], 
        [
            0.99829999999999997
        ], 
        [
            0.99797999999999998
        ], 
        [
            0.99819999999999998
        ], 
        [
            0.99822
        ], 
        [
            0.99812000001907353
        ], 
        [
            0.99797999999999998
        ], 
        [
            0.99843999999999999
        ], 
        [
            0.99830000001907349
        ], 
        [
            0.998
        ]
    ], 
    "train_losses": [
        [
            1.5434525036621094
        ], 
        [
            1.0648990180969238
        ], 
        [
            0.87650926635742188
        ], 
        [
            0.75996230390548702
        ], 
        [
            0.67962397436141964
        ], 
        [
            0.6344898920822144
        ], 
        [
            0.59120917331695555
        ], 
        [
            0.547525354976654
        ], 
        [
            0.51070627466201779
        ], 
        [
            0.44930305000305176
        ], 
        [
            0.40608647556304933
        ], 
        [
            0.3644150449562073
        ], 
        [
            0.29303663825988768
        ], 
        [
            0.25101797276973725
        ], 
        [
            0.22479182611465454
        ], 
        [
            0.17808649057865142
        ], 
        [
            0.16158858649492264
        ], 
        [
            0.14754639558315277
        ], 
        [
            0.11524842430949211
        ], 
        [
            0.093641085889339448
        ], 
        [
            0.072711799561977389
        ], 
        [
            0.062366350928544999
        ], 
        [
            0.056180863858461383
        ], 
        [
            0.049618150911331177
        ], 
        [
            0.045589233264029028
        ], 
        [
            0.042458424956798552
        ], 
        [
            0.03664180140256882
        ], 
        [
            0.033717816920280454
        ], 
        [
            0.032055260684173553
        ], 
        [
            0.029225760442912578
        ], 
        [
            0.029200370709896086
        ], 
        [
            0.028067613682597876
        ], 
        [
            0.029266310186833143
        ], 
        [
            0.025050176020413636
        ], 
        [
            0.024344560434222222
        ], 
        [
            0.023818559626080097
        ], 
        [
            0.022907047715485095
        ], 
        [
            0.022025470393002032
        ], 
        [
            0.022256639052554966
        ], 
        [
            0.022834866320043803
        ], 
        [
            0.019201840398162605
        ], 
        [
            0.018458334799464793
        ], 
        [
            0.018786770270653071
        ], 
        [
            0.019407712481170892
        ], 
        [
            0.016339491097852588
        ], 
        [
            0.018599067700207233
        ], 
        [
            0.019747862196080386
        ], 
        [
            0.016831779705397783
        ], 
        [
            0.014319776826836168
        ], 
        [
            0.01603733715388924
        ], 
        [
            0.016538046874292195
        ], 
        [
            0.016800176707357169
        ], 
        [
            0.013321507066562772
        ], 
        [
            0.014473976070433854
        ], 
        [
            0.013957290855213068
        ], 
        [
            0.012920736211156473
        ], 
        [
            0.01352717017179355
        ], 
        [
            0.012856120456606149
        ], 
        [
            0.012314312969725578
        ], 
        [
            0.015902611737102269
        ], 
        [
            0.013597422052659094
        ], 
        [
            0.013663599252775311
        ], 
        [
            0.014850636441893876
        ], 
        [
            0.013710817554350942
        ], 
        [
            0.01227191306002438
        ], 
        [
            0.013310495096836239
        ], 
        [
            0.010912245766688138
        ], 
        [
            0.013089625107366592
        ], 
        [
            0.0098572610855475074
        ], 
        [
            0.012687379999672994
        ], 
        [
            0.011640197440050543
        ], 
        [
            0.011268373383805156
        ], 
        [
            0.010934496602658182
        ], 
        [
            0.011311529547739774
        ], 
        [
            0.012194764723107218
        ], 
        [
            0.011810722655877471
        ], 
        [
            0.0100457706839405
        ], 
        [
            0.011290789463371038
        ], 
        [
            0.010933337356094272
        ], 
        [
            0.01150197813840583
        ], 
        [
            0.010207179673016072
        ], 
        [
            0.010457488362845033
        ], 
        [
            0.01136940844900906
        ], 
        [
            0.012102557330802084
        ], 
        [
            0.010310144912945107
        ], 
        [
            0.0081350803656689823
        ], 
        [
            0.010546957719512284
        ], 
        [
            0.010754070035438053
        ], 
        [
            0.0089729340681247421
        ], 
        [
            0.01093225139846094
        ], 
        [
            0.01027671585346572
        ], 
        [
            0.011013290356276557
        ], 
        [
            0.010735766021199524
        ], 
        [
            0.0083396478061657404
        ], 
        [
            0.010413807063177228
        ], 
        [
            0.010593670507986099
        ], 
        [
            0.0081095333868637688
        ], 
        [
            0.0090348345748521384
        ], 
        [
            0.0099910787243396044
        ], 
        [
            0.0094766677341423921
        ], 
        [
            0.0081297170530445877
        ], 
        [
            0.0088448194629885263
        ], 
        [
            0.0081465157775487754
        ], 
        [
            0.0092197345671150826
        ], 
        [
            0.0088497952185710889
        ], 
        [
            0.0092206106378836562
        ], 
        [
            0.010196425663633272
        ], 
        [
            0.0077310135195590556
        ], 
        [
            0.0092860818977188314
        ], 
        [
            0.0079576791780814529
        ], 
        [
            0.0076024350591655824
        ], 
        [
            0.0079730493380734697
        ], 
        [
            0.0092664760195277623
        ], 
        [
            0.0082591173807857552
        ], 
        [
            0.0075787426907662301
        ], 
        [
            0.0059193462403304871
        ], 
        [
            0.0085506086715077985
        ], 
        [
            0.008016845201347024
        ], 
        [
            0.0088686146977031595
        ], 
        [
            0.0085018095858767628
        ], 
        [
            0.0083960734577337281
        ], 
        [
            0.0073294785024272278
        ], 
        [
            0.0078923508874652916
        ], 
        [
            0.0075828428024565797
        ], 
        [
            0.0071761137791210789
        ], 
        [
            0.0070846642424678427
        ], 
        [
            0.0071151664789579809
        ], 
        [
            0.0069909486208762977
        ], 
        [
            0.0087880079732718872
        ], 
        [
            0.0064328916438762098
        ], 
        [
            0.0069906953763030468
        ], 
        [
            0.0086005495520401747
        ], 
        [
            0.0066157694366620855
        ], 
        [
            0.0059878816396184264
        ], 
        [
            0.0075920703007141127
        ], 
        [
            0.0059549299842881738
        ], 
        [
            0.0072939033572515469
        ], 
        [
            0.0064932551085157319
        ], 
        [
            0.010240264026336371
        ], 
        [
            0.0074303682478144761
        ], 
        [
            0.0079031063366401949
        ], 
        [
            0.0076015515597618651
        ], 
        [
            0.0074661156854080035
        ], 
        [
            0.0069162169317156076
        ], 
        [
            0.0075793879022449254
        ], 
        [
            0.0062322785172541622
        ], 
        [
            0.0072717560420464721
        ], 
        [
            0.007248032683786005
        ], 
        [
            0.0065469304826483131
        ], 
        [
            0.0062258155833650377
        ], 
        [
            0.0058391782239521853
        ], 
        [
            0.0084228295048566354
        ], 
        [
            0.0056578363028421882
        ], 
        [
            0.0065512483978248199
        ], 
        [
            0.0074153111392399294
        ], 
        [
            0.0060292987046670172
        ], 
        [
            0.005820108112283051
        ], 
        [
            0.0073057575143943539
        ], 
        [
            0.006144847451997921
        ], 
        [
            0.0082938937044888736
        ], 
        [
            0.0060416802029171959
        ], 
        [
            0.0063114635118958536
        ], 
        [
            0.0068356502998038193
        ], 
        [
            0.0061143208659044466
        ], 
        [
            0.0057958081601420415
        ], 
        [
            0.0078076563817216079
        ], 
        [
            0.0075729727953905241
        ], 
        [
            0.0059852943839202631
        ], 
        [
            0.0061284894503187389
        ], 
        [
            0.0063056882286572366
        ], 
        [
            0.0057625434569816567
        ], 
        [
            0.0054778603013488462
        ], 
        [
            0.0068363617759011688
        ], 
        [
            0.0061036580909090117
        ], 
        [
            0.0059962302046013063
        ], 
        [
            0.006355778564962093
        ], 
        [
            0.0067521554910298437
        ], 
        [
            0.0069773889040783982
        ], 
        [
            0.0064646923038153906
        ], 
        [
            0.006193586904940894
        ], 
        [
            0.0065174101516581144
        ], 
        [
            0.004883659733380191
        ], 
        [
            0.0065405230268812736
        ], 
        [
            0.0062232483118632807
        ], 
        [
            0.0058062973395735023
        ], 
        [
            0.0065518963377270848
        ], 
        [
            0.0061828602794650944
        ], 
        [
            0.0053800516177271492
        ], 
        [
            0.0058424281696300021
        ], 
        [
            0.005994830749924295
        ], 
        [
            0.0062474208773416464
        ], 
        [
            0.0060537418872141282
        ], 
        [
            0.0062255529755097811
        ], 
        [
            0.0054720034337684045
        ], 
        [
            0.0062310005872091281
        ], 
        [
            0.0063323484770627693
        ], 
        [
            0.005694775288596866
        ], 
        [
            0.0051410877990699377
        ], 
        [
            0.0053742410079739055
        ], 
        [
            0.0059003990984661508
        ]
    ], 
    "val_accs": [
        [
            0.59530000000000005
        ], 
        [
            0.65590000000000004
        ], 
        [
            0.68089999999999995
        ], 
        [
            0.73929999999999996
        ], 
        [
            0.71409999999999996
        ], 
        [
            0.73709999999999998
        ], 
        [
            0.72760000000000002
        ], 
        [
            0.7419
        ], 
        [
            0.73560000000000003
        ], 
        [
            0.74319999999999997
        ], 
        [
            0.73980000000000001
        ], 
        [
            0.74229999999999996
        ], 
        [
            0.75029999999999997
        ], 
        [
            0.74309999999999998
        ], 
        [
            0.74950000000000006
        ], 
        [
            0.76349999999999996
        ], 
        [
            0.75049999999999994
        ], 
        [
            0.75780000000000003
        ], 
        [
            0.76590000000000003
        ], 
        [
            0.77090000000000003
        ], 
        [
            0.77229999999999999
        ], 
        [
            0.77180000000000004
        ], 
        [
            0.7762
        ], 
        [
            0.77739999999999998
        ], 
        [
            0.77649999999999997
        ], 
        [
            0.77759999999999996
        ], 
        [
            0.77629999999999999
        ], 
        [
            0.78239999999999998
        ], 
        [
            0.78310000000000002
        ], 
        [
            0.78220000000000001
        ], 
        [
            0.78580000000000005
        ], 
        [
            0.78120000000000001
        ], 
        [
            0.77849999999999997
        ], 
        [
            0.78129999999999999
        ], 
        [
            0.78120000000000001
        ], 
        [
            0.78220000000000001
        ], 
        [
            0.78120000000000001
        ], 
        [
            0.78369999999999995
        ], 
        [
            0.78239999999999998
        ], 
        [
            0.78390000000000004
        ], 
        [
            0.78400000000000003
        ], 
        [
            0.78200000000000003
        ], 
        [
            0.78459999999999996
        ], 
        [
            0.78320000000000001
        ], 
        [
            0.78469999999999995
        ], 
        [
            0.7853
        ], 
        [
            0.7823
        ], 
        [
            0.78390000000000004
        ], 
        [
            0.78310000000000002
        ], 
        [
            0.7853
        ], 
        [
            0.78839999999999999
        ], 
        [
            0.78759999999999997
        ], 
        [
            0.78559999999999997
        ], 
        [
            0.78500000000000003
        ], 
        [
            0.78569999999999995
        ], 
        [
            0.78769999999999996
        ], 
        [
            0.7883
        ], 
        [
            0.78420000000000001
        ], 
        [
            0.78539999999999999
        ], 
        [
            0.78380000000000005
        ], 
        [
            0.78349999999999997
        ], 
        [
            0.78920000000000001
        ], 
        [
            0.78790000000000004
        ], 
        [
            0.78879999999999995
        ], 
        [
            0.78580000000000005
        ], 
        [
            0.79100000000000004
        ], 
        [
            0.78900000000000003
        ], 
        [
            0.78890000000000005
        ], 
        [
            0.78839999999999999
        ], 
        [
            0.79010000000000002
        ], 
        [
            0.78439999999999999
        ], 
        [
            0.78769999999999996
        ], 
        [
            0.78979999999999995
        ], 
        [
            0.78820000000000001
        ], 
        [
            0.78869999999999996
        ], 
        [
            0.78959999999999997
        ], 
        [
            0.78820000000000001
        ], 
        [
            0.78839999999999999
        ], 
        [
            0.78800000000000003
        ], 
        [
            0.78979999999999995
        ], 
        [
            0.78769999999999996
        ], 
        [
            0.78720000000000001
        ], 
        [
            0.78759999999999997
        ], 
        [
            0.78700000000000003
        ], 
        [
            0.78920000000000001
        ], 
        [
            0.7863
        ], 
        [
            0.78890000000000005
        ], 
        [
            0.78610000000000002
        ], 
        [
            0.78659999999999997
        ], 
        [
            0.78559999999999997
        ], 
        [
            0.7833
        ], 
        [
            0.78790000000000004
        ], 
        [
            0.78539999999999999
        ], 
        [
            0.78810000000000002
        ], 
        [
            0.78669999999999995
        ], 
        [
            0.78890000000000005
        ], 
        [
            0.78810000000000002
        ], 
        [
            0.78700000000000003
        ], 
        [
            0.78690000000000004
        ], 
        [
            0.78939999999999999
        ], 
        [
            0.78580000000000005
        ], 
        [
            0.78790000000000004
        ], 
        [
            0.79039999999999999
        ], 
        [
            0.78990000000000005
        ], 
        [
            0.78549999999999998
        ], 
        [
            0.78769999999999996
        ], 
        [
            0.7893
        ], 
        [
            0.78710000000000002
        ], 
        [
            0.7863
        ], 
        [
            0.78920000000000001
        ], 
        [
            0.79069999999999996
        ], 
        [
            0.79110000000000003
        ], 
        [
            0.79110000000000003
        ], 
        [
            0.7913
        ], 
        [
            0.7883
        ], 
        [
            0.79020000000000001
        ], 
        [
            0.7944
        ], 
        [
            0.79169999999999996
        ], 
        [
            0.78869999999999996
        ], 
        [
            0.7863
        ], 
        [
            0.78839999999999999
        ], 
        [
            0.78849999999999998
        ], 
        [
            0.78939999999999999
        ], 
        [
            0.78690000000000004
        ], 
        [
            0.7883
        ], 
        [
            0.78979999999999995
        ], 
        [
            0.79049999999999998
        ], 
        [
            0.79079999999999995
        ], 
        [
            0.7903
        ], 
        [
            0.78790000000000004
        ], 
        [
            0.78710000000000002
        ], 
        [
            0.79149999999999998
        ], 
        [
            0.78959999999999997
        ], 
        [
            0.78739999999999999
        ], 
        [
            0.79100000000000004
        ], 
        [
            0.78859999999999997
        ], 
        [
            0.78790000000000004
        ], 
        [
            0.78790000000000004
        ], 
        [
            0.78900000000000003
        ], 
        [
            0.7863
        ], 
        [
            0.78920000000000001
        ], 
        [
            0.79000000000000004
        ], 
        [
            0.78720000000000001
        ], 
        [
            0.78959999999999997
        ], 
        [
            0.78669999999999995
        ], 
        [
            0.78869999999999996
        ], 
        [
            0.78979999999999995
        ], 
        [
            0.78849999999999998
        ], 
        [
            0.78920000000000001
        ], 
        [
            0.78959999999999997
        ], 
        [
            0.79159999999999997
        ], 
        [
            0.78979999999999995
        ], 
        [
            0.79059999999999997
        ], 
        [
            0.78790000000000004
        ], 
        [
            0.7923
        ], 
        [
            0.79020000000000001
        ], 
        [
            0.78890000000000005
        ], 
        [
            0.78759999999999997
        ], 
        [
            0.79010000000000002
        ], 
        [
            0.79220000000000002
        ], 
        [
            0.79339999999999999
        ], 
        [
            0.79400000000000004
        ], 
        [
            0.79079999999999995
        ], 
        [
            0.79169999999999996
        ], 
        [
            0.79159999999999997
        ], 
        [
            0.78800000000000003
        ], 
        [
            0.78639999999999999
        ], 
        [
            0.79139999999999999
        ], 
        [
            0.79149999999999998
        ], 
        [
            0.79110000000000003
        ], 
        [
            0.79000000000000004
        ], 
        [
            0.79379999999999995
        ], 
        [
            0.78779999999999994
        ], 
        [
            0.79100000000000004
        ], 
        [
            0.79310000000000003
        ], 
        [
            0.7923
        ], 
        [
            0.79390000000000005
        ], 
        [
            0.78910000000000002
        ], 
        [
            0.79220000000000002
        ], 
        [
            0.78910000000000002
        ], 
        [
            0.79020000000000001
        ], 
        [
            0.79259999999999997
        ], 
        [
            0.79220000000000002
        ], 
        [
            0.79169999999999996
        ], 
        [
            0.78959999999999997
        ], 
        [
            0.7913
        ], 
        [
            0.79339999999999999
        ], 
        [
            0.79249999999999998
        ], 
        [
            0.79179999999999995
        ], 
        [
            0.78890000000000005
        ], 
        [
            0.78920000000000001
        ], 
        [
            0.79100000000000004
        ], 
        [
            0.78800000000000003
        ], 
        [
            0.79200000000000004
        ], 
        [
            0.79010000000000002
        ], 
        [
            0.79139999999999999
        ], 
        [
            0.78900000000000003
        ], 
        [
            0.78990000000000005
        ], 
        [
            0.78939999999999999
        ], 
        [
            0.79069999999999996
        ]
    ], 
    "val_losses": [
        [
            1.1543937629699708
        ], 
        [
            0.97122757139205929
        ], 
        [
            0.91225428380966189
        ], 
        [
            0.75898069486618047
        ], 
        [
            0.83746622476577759
        ], 
        [
            0.7774179589271546
        ], 
        [
            0.81632443389892573
        ], 
        [
            0.80568182125091548
        ], 
        [
            0.8192101250648498
        ], 
        [
            0.8394329462051392
        ], 
        [
            0.86195190162658697
        ], 
        [
            0.84293494253158574
        ], 
        [
            0.91447379951477048
        ], 
        [
            1.0043309000015259
        ], 
        [
            0.97267741622924808
        ], 
        [
            1.0551153964996338
        ], 
        [
            1.0904231172561645
        ], 
        [
            1.1041230339050292
        ], 
        [
            1.0877159736633302
        ], 
        [
            1.1495994968414307
        ], 
        [
            1.1763008093833924
        ], 
        [
            1.2186073663711547
        ], 
        [
            1.2483394306182862
        ], 
        [
            1.2580689840316772
        ], 
        [
            1.2664261034965516
        ], 
        [
            1.2480378852844238
        ], 
        [
            1.282537268447876
        ], 
        [
            1.3141708164215087
        ], 
        [
            1.3091229864120484
        ], 
        [
            1.357881301498413
        ], 
        [
            1.3074495622634887
        ], 
        [
            1.3187731306076049
        ], 
        [
            1.3696935871124267
        ], 
        [
            1.3566374820709228
        ], 
        [
            1.3761208084106444
        ], 
        [
            1.3832852579116821
        ], 
        [
            1.3995024140357972
        ], 
        [
            1.381539295578003
        ], 
        [
            1.3894450088500976
        ], 
        [
            1.3732216562271118
        ], 
        [
            1.3809894018173219
        ], 
        [
            1.4153463920593261
        ], 
        [
            1.4188499837875366
        ], 
        [
            1.4304472675323487
        ], 
        [
            1.4451017553329468
        ], 
        [
            1.4327288471221924
        ], 
        [
            1.4700371925354003
        ], 
        [
            1.4495348312377929
        ], 
        [
            1.4470152784347534
        ], 
        [
            1.450054656791687
        ], 
        [
            1.4408564414978027
        ], 
        [
            1.4224450025558473
        ], 
        [
            1.4420076673507691
        ], 
        [
            1.4563097511291503
        ], 
        [
            1.4692460014343263
        ], 
        [
            1.4793829504013061
        ], 
        [
            1.4936738185882568
        ], 
        [
            1.5052224550247193
        ], 
        [
            1.5107948177337647
        ], 
        [
            1.4892107162475585
        ], 
        [
            1.5041167407989502
        ], 
        [
            1.4822589502334595
        ], 
        [
            1.4716683362960816
        ], 
        [
            1.4963779674530029
        ], 
        [
            1.4683375598907471
        ], 
        [
            1.4471006435394287
        ], 
        [
            1.476320998954773
        ], 
        [
            1.4817379371643067
        ], 
        [
            1.4855322706222533
        ], 
        [
            1.4692756921768189
        ], 
        [
            1.4901024984359741
        ], 
        [
            1.4599585006713867
        ], 
        [
