{
    "batch_size": 128, 
    "class_name": "Model", 
    "config": {
        "input_layers": [
            [
                "input", 
                0, 
                0
            ]
        ], 
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "batch_input_shape": [
                        null, 
                        3, 
                        32, 
                        32
                    ], 
                    "input_dtype": "float32", 
                    "name": "input", 
                    "sparse": false
                }, 
                "inbound_nodes": [], 
                "name": "input"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_9", 
                    "nb_col": 3, 
                    "nb_filter": 32, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_9"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_9", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_9", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_9"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_10", 
                    "nb_col": 3, 
                    "nb_filter": 32, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_9", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_10"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_10", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_10", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_10"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "border_mode": "valid", 
                    "dim_ordering": "th", 
                    "name": "maxpooling2d_5", 
                    "pool_size": [
                        2, 
                        2
                    ], 
                    "strides": [
                        2, 
                        2
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_10", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "maxpooling2d_5"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "name": "dropout_5", 
                    "p": 0.25, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "maxpooling2d_5", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dropout_5"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_11", 
                    "nb_col": 3, 
                    "nb_filter": 64, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dropout_5", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_11"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_11", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_11", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_11"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_12", 
                    "nb_col": 3, 
                    "nb_filter": 64, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_11", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_12"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_12", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_12", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_12"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "border_mode": "valid", 
                    "dim_ordering": "th", 
                    "name": "maxpooling2d_6", 
                    "pool_size": [
                        2, 
                        2
                    ], 
                    "strides": [
                        2, 
                        2
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_12", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "maxpooling2d_6"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "name": "dropout_6", 
                    "p": 0.25, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "maxpooling2d_6", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dropout_6"
            }, 
            {
                "class_name": "Flatten", 
                "config": {
                    "name": "flatten_3", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dropout_6", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "flatten_3"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": null, 
                    "activation": "relu", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "init": "glorot_uniform", 
                    "input_dim": null, 
                    "name": "dense_5", 
                    "output_dim": 512, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "flatten_3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dense_5"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": null, 
                    "activation": "softmax", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "init": "glorot_uniform", 
                    "input_dim": null, 
                    "name": "dense_6", 
                    "output_dim": 10, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dense_5", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dense_6"
            }
        ], 
        "name": "CNN", 
        "output_layers": [
            [
                "dense_6", 
                0, 
                0
            ]
        ]
    }, 
    "experiment_name": "Adam", 
    "img_dim": [
        3, 
        32, 
        32
    ], 
    "keras_version": "1.1.0", 
    "nb_epoch": 200, 
    "optimizer": {
        "beta_1": 0.8999999761581421, 
        "beta_2": 0.9990000128746033, 
        "epsilon": 1e-08, 
        "lr": 0.0010000000474974513
    }, 
    "train_accs": [
        [
            0.46324000001907351
        ], 
        [
            0.62399999998092648
        ], 
        [
            0.69802000003814701
        ], 
        [
            0.74137999998092652
        ], 
        [
            0.77910000003814694
        ], 
        [
            0.81134000001907347
        ], 
        [
            0.84088000001907348
        ], 
        [
            0.87019999999999997
        ], 
        [
            0.89081999999999995
        ], 
        [
            0.91235999996185302
        ], 
        [
            0.92437999998092646
        ], 
        [
            0.93649999998092648
        ], 
        [
            0.94282000003814692
        ], 
        [
            0.95081999998092648
        ], 
        [
            0.95499999998092655
        ], 
        [
            0.95811999999999997
        ], 
        [
            0.961299999961853
        ], 
        [
            0.96299999996185304
        ], 
        [
            0.96664000000000005
        ], 
        [
            0.96747999996185308
        ], 
        [
            0.96896000000000004
        ], 
        [
            0.97058000001907352
        ], 
        [
            0.971320000038147
        ], 
        [
            0.97107999998092653
        ], 
        [
            0.97594000003814696
        ], 
        [
            0.97559999996185298
        ], 
        [
            0.97390000001907351
        ], 
        [
            0.97538000003814695
        ], 
        [
            0.97794000000000003
        ], 
        [
            0.97662000001907345
        ], 
        [
            0.97841999996185303
        ], 
        [
            0.97825999996185298
        ], 
        [
            0.97846000001907352
        ], 
        [
            0.97972000003814697
        ], 
        [
            0.97882000001907343
        ], 
        [
            0.97767999996185306
        ], 
        [
            0.97972000001907344
        ], 
        [
            0.978839999961853
        ], 
        [
            0.98138000000000003
        ], 
        [
            0.98141999999999996
        ], 
        [
            0.98114000001907353
        ], 
        [
            0.98162000003814698
        ], 
        [
            0.98099999999999998
        ], 
        [
            0.98310000001907349
        ], 
        [
            0.98242000001907348
        ], 
        [
            0.98350000001907345
        ], 
        [
            0.98352000001907347
        ], 
        [
            0.98320000001907348
        ], 
        [
            0.98348000001907354
        ], 
        [
            0.98318000001907346
        ], 
        [
            0.98380000001907353
        ], 
        [
            0.985860000038147
        ], 
        [
            0.98628000000000005
        ], 
        [
            0.98446
        ], 
        [
            0.98392000003814695
        ], 
        [
            0.98448000001907343
        ], 
        [
            0.98436000003814694
        ], 
        [
            0.98518000001907347
        ], 
        [
            0.98623999996185308
        ], 
        [
            0.98523999996185307
        ], 
        [
            0.986640000038147
        ], 
        [
            0.98670000001907343
        ], 
        [
            0.98570000003814695
        ], 
        [
            0.98682000001907344
        ], 
        [
            0.98658000001907353
        ], 
        [
            0.98634000001907352
        ], 
        [
            0.98618000001907347
        ], 
        [
            0.98750000001907345
        ], 
        [
            0.98707999999999996
        ], 
        [
            0.98798000001907349
        ], 
        [
            0.98718000003814699
        ], 
        [
            0.98620000001907349
        ], 
        [
            0.98763999999999996
        ], 
        [
            0.98602000001907353
        ], 
        [
            0.9858800000190735
        ], 
        [
            0.98828000003814698
        ], 
        [
            0.98839999999999995
        ], 
        [
            0.98698000003814701
        ], 
        [
            0.9879
        ], 
        [
            0.98825999996185299
        ], 
        [
            0.98876000003814701
        ], 
        [
            0.98726000000000003
        ], 
        [
            0.98798000003814701
        ], 
        [
            0.98768
        ], 
        [
            0.9879
        ], 
        [
            0.98791999996185298
        ], 
        [
            0.9881000000190735
        ], 
        [
            0.98734000003814693
        ], 
        [
            0.98872000001907345
        ], 
        [
            0.9883200000190735
        ], 
        [
            0.98890000001907352
        ], 
        [
            0.98904000001907344
        ], 
        [
            0.98943999998092647
        ], 
        [
            0.98948000000000003
        ], 
        [
            0.98830000001907348
        ], 
        [
            0.99017999999999995
        ], 
        [
            0.98931999996185305
        ], 
        [
            0.98812
        ], 
        [
            0.98802000001907353
        ], 
        [
            0.98917999999999995
        ], 
        [
            0.98930000001907348
        ], 
        [
            0.98960000003814697
        ], 
        [
            0.98946000000000001
        ], 
        [
            0.98960000000000004
        ], 
        [
            0.98832000003814702
        ], 
        [
            0.98962000000000006
        ], 
        [
            0.989080000038147
        ], 
        [
            0.98838000001907345
        ], 
        [
            0.99026000000000003
        ], 
        [
            0.99060000001907345
        ], 
        [
            0.98921999999999999
        ], 
        [
            0.98929999999999996
        ], 
        [
            0.99061999999999995
        ], 
        [
            0.98896000001907347
        ], 
        [
            0.98978000001907351
        ], 
        [
            0.99028000000000005
        ], 
        [
            0.99031999996185305
        ], 
        [
            0.99026000000000003
        ], 
        [
            0.99073999999999995
        ], 
        [
            0.98930000001907348
        ], 
        [
            0.98980000001907353
        ], 
        [
            0.98958000000000002
        ], 
        [
            0.99084000000000005
        ], 
        [
            0.99030000001907348
        ], 
        [
            0.99002000000000001
        ], 
        [
            0.98868000001907352
        ], 
        [
            0.98962000001907346
        ], 
        [
            0.99095999999999995
        ], 
        [
            0.99204000001907344
        ], 
        [
            0.99053999999999998
        ], 
        [
            0.99078000001907351
        ], 
        [
            0.98956000003814693
        ], 
        [
            0.99099999999999999
        ], 
        [
            0.98958000003814695
        ], 
        [
            0.99165999999999999
        ], 
        [
            0.99066000001907351
        ], 
        [
            0.99021999996185306
        ], 
        [
            0.99042000003814701
        ], 
        [
            0.99062000001907347
        ], 
        [
            0.98860000000000003
        ], 
        [
            0.99143999999999999
        ], 
        [
            0.99060000001907345
        ], 
        [
            0.99063999996185303
        ], 
        [
            0.98902000000000001
        ], 
        [
            0.99070000001907343
        ], 
        [
            0.99139999999999995
        ], 
        [
            0.99153999999999998
        ], 
        [
            0.99112
        ], 
        [
            0.98970000000000002
        ], 
        [
            0.99026000000000003
        ], 
        [
            0.99090000003814693
        ], 
        [
            0.99106000001907346
        ], 
        [
            0.99178000003814692
        ], 
        [
            0.99138000000000004
        ], 
        [
            0.99026000000000003
        ], 
        [
            0.99121999999999999
        ], 
        [
            0.99004000001907344
        ], 
        [
            0.99099999999999999
        ], 
        [
            0.99241999999999997
        ], 
        [
            0.99117999999999995
        ], 
        [
            0.99060000000000004
        ], 
        [
            0.99050000000000005
        ], 
        [
            0.99234000001907352
        ], 
        [
            0.99043999999999999
        ], 
        [
            0.99028000000000005
        ], 
        [
            0.99226000000000003
        ], 
        [
            0.99175999999999997
        ], 
        [
            0.99122000001907351
        ], 
        [
            0.99022000001907351
        ], 
        [
            0.99156000001907352
        ], 
        [
            0.99164000001907349
        ], 
        [
            0.99153999999999998
        ], 
        [
            0.98982000000000003
        ], 
        [
            0.99139999999999995
        ], 
        [
            0.99134
        ], 
        [
            0.99192000000000002
        ], 
        [
            0.99109999999999998
        ], 
        [
            0.99119999999999997
        ], 
        [
            0.99128000000000005
        ], 
        [
            0.99173999999999995
        ], 
        [
            0.99226000000000003
        ], 
        [
            0.99292000000000002
        ], 
        [
            0.9898800000190735
        ], 
        [
            0.99170000000000003
        ], 
        [
            0.99087999999999998
        ], 
        [
            0.99140000001907347
        ], 
        [
            0.99284000001907347
        ], 
        [
            0.99041999999999997
        ], 
        [
            0.99256
        ], 
        [
            0.99138000001907345
        ], 
        [
            0.99131999999999998
        ], 
        [
            0.99142000001907349
        ], 
        [
            0.99306000000000005
        ], 
        [
            0.99212
        ], 
        [
            0.99184000000000005
        ], 
        [
            0.99128000003814698
        ], 
        [
            0.99324000000000001
        ], 
        [
            0.99307999996185303
        ], 
        [
            0.99192000001907343
        ], 
        [
            0.99146000001907353
        ]
    ], 
    "train_losses": [
        [
            1.4854911911201476
        ], 
        [
            1.0561276979637146
        ], 
        [
            0.85947464786529537
        ], 
        [
            0.73678202520370484
        ], 
        [
            0.63236891044616694
        ], 
        [
            0.53508324268341068
        ], 
        [
            0.4500125772857666
        ], 
        [
            0.37085437107086183
        ], 
        [
            0.30797674185752871
        ], 
        [
            0.24870618040084838
        ], 
        [
            0.21626751833915711
        ], 
        [
            0.17858002274513243
        ], 
        [
            0.1600950251865387
        ], 
        [
            0.13974665821075438
        ], 
        [
            0.12735753281116485
        ], 
        [
            0.11973924049019813
        ], 
        [
            0.11208640372753144
        ], 
        [
            0.10737544186353684
        ], 
        [
            0.097629426779747008
        ], 
        [
            0.093937518894672389
        ], 
        [
            0.089069450469017028
        ], 
        [
            0.08589825982332229
        ], 
        [
            0.082994900140762329
        ], 
        [
            0.083258280878067012
        ], 
        [
            0.07253879369258881
        ], 
        [
            0.071868065390586849
        ], 
        [
            0.077725613862276083
        ], 
        [
            0.070868436932563783
        ], 
        [
            0.06591293306291103
        ], 
        [
            0.07002411828041076
        ], 
        [
            0.063980896732211107
        ], 
        [
            0.066570201957225794
        ], 
        [
            0.063474606684446336
        ], 
        [
            0.06088803404569626
        ], 
        [
            0.062943114987611765
        ], 
        [
            0.065786993767023086
        ], 
        [
            0.060900934924483299
        ], 
        [
            0.060813416016101837
        ], 
        [
            0.055552994381785389
        ], 
        [
            0.057038957516252993
        ], 
        [
            0.055850721920132636
        ], 
        [
            0.053678575898408888
        ], 
        [
            0.056370836692005398
        ], 
        [
            0.049539849807024
        ], 
        [
            0.053919154913723469
        ], 
        [
            0.050864511427283286
        ], 
        [
            0.049874208931326866
        ], 
        [
            0.050289892052412036
        ], 
        [
            0.050568745837807655
        ], 
        [
            0.051240918365120888
        ], 
        [
            0.049450033792257306
        ], 
        [
            0.042663996357321737
        ], 
        [
            0.043585613322257993
        ], 
        [
            0.047583492207825186
        ], 
        [
            0.049666486364006994
        ], 
        [
            0.048447102003693579
        ], 
        [
            0.046858431199193001
        ], 
        [
            0.043681625038385394
        ], 
        [
            0.044605029498040676
        ], 
        [
            0.047424725888967512
        ], 
        [
            0.042693749296069144
        ], 
        [
            0.04281015350282192
        ], 
        [
            0.044666179532408715
        ], 
        [
            0.042332571192979812
        ], 
        [
            0.042357677046656605
        ], 
        [
            0.043184290099292991
        ], 
        [
            0.044149875417053702
        ], 
        [
            0.039737986070215704
        ], 
        [
            0.040026072023808958
        ], 
        [
            0.03925267846107483
        ], 
        [
            0.043000296284854411
        ], 
        [
            0.041386677712202072
        ], 
        [
            0.039562653302550314
        ], 
        [
            0.045731779662668705
        ], 
        [
            0.044886414834856989
        ], 
        [
            0.036995596462339166
        ], 
        [
            0.036035894431471822
        ], 
        [
            0.040853357736766335
        ], 
        [
            0.036478396211490037
        ], 
        [
            0.037058007062301036
        ], 
        [
            0.037596790428757666
        ], 
        [
            0.040541792658865448
        ], 
        [
            0.038162112398371098
        ], 
        [
            0.039280219034478071
        ], 
        [
            0.038947992297410965
        ], 
        [
            0.039055700443089009
        ], 
        [
            0.037217464962154626
        ], 
        [
            0.042372642381638286
        ], 
        [
            0.035847617780342698
        ], 
        [
            0.038087556720077992
        ], 
        [
            0.035538571835830805
        ], 
        [
            0.036325917498245833
        ], 
        [
            0.034072956903129815
        ], 
        [
            0.035078441239893433
        ], 
        [
            0.038117103370726109
        ], 
        [
            0.032912637285888197
        ], 
        [
            0.033976336415745316
        ], 
        [
            0.039847289490178225
        ], 
        [
            0.039580222485959528
        ], 
        [
            0.034285024942159653
        ], 
        [
            0.034574273163452747
        ], 
        [
            0.034699732837677001
        ], 
        [
            0.034394000176414849
        ], 
        [
            0.033189135842844844
        ], 
        [
            0.039025803908444942
        ], 
        [
            0.033482631650939586
        ], 
        [
            0.035051677398178729
        ], 
        [
            0.039450112024694679
        ], 
        [
            0.033171146864239123
        ], 
        [
            0.03124352865371853
        ], 
        [
            0.035621114247511139
        ], 
        [
            0.035295796654373407
        ], 
        [
            0.032553739710878583
        ], 
        [
            0.037379243755228816
        ], 
        [
            0.034759464012607932
        ], 
        [
            0.03226001838237047
        ], 
        [
            0.032214461045060309
        ], 
        [
            0.033178012737892566
        ], 
        [
            0.032766828735694288
        ], 
        [
            0.036256956564337015
        ], 
        [
            0.035912818901985881
        ], 
        [
            0.035253540128618477
        ], 
        [
            0.031097651763260365
        ], 
        [
            0.033272652326375246
        ], 
        [
            0.033177703156284988
        ], 
        [
            0.039344272465482354
        ], 
        [
            0.037175054433345796
        ], 
        [
            0.029702071600891649
        ], 
        [
            0.026900184762571007
        ], 
        [
            0.032836386725548658
        ], 
        [
            0.030763439828678966
        ], 
        [
            0.035004186938703059
        ], 
        [
            0.031322692376133054
        ], 
        [
            0.036204917709603907
        ], 
        [
            0.027809335831515489
        ], 
        [
            0.032067385006956758
        ], 
        [
            0.035704086025357247
        ], 
        [
            0.030495430811867119
        ], 
        [
            0.032900072330459953
        ], 
        [
            0.038961979039441791
        ], 
        [
            0.030595938479155302
        ], 
        [
            0.030956472809426486
        ], 
        [
            0.032685098982863127
        ], 
        [
            0.038708582326546309
        ], 
        [
            0.032086123473644257
        ], 
        [
            0.028687839340083301
        ], 
        [
            0.028863294521160425
        ], 
        [
            0.03168892968857661
        ], 
        [
            0.036099511792454866
        ], 
        [
            0.033882913512475792
        ], 
        [
            0.033166029961183667
        ], 
        [
            0.031041741930171847
        ], 
        [
            0.02893837051407434
        ], 
        [
            0.031164160507405177
        ], 
        [
            0.032732008198928089
        ], 
        [
            0.028494239734821021
        ], 
        [
            0.034841548111438754
        ], 
        [
            0.03032910257808864
        ], 
        [
            0.026546713120071216
        ], 
        [
            0.03185415614899248
        ], 
        [
            0.032226237290557472
        ], 
        [
            0.033536148659102621
        ], 
        [
            0.027226579966694118
        ], 
        [
            0.034105053152898329
        ], 
        [
            0.037485439966861156
        ], 
        [
            0.025477674940116702
        ], 
        [
            0.029872295539577026
        ], 
        [
            0.034180867855902762
        ], 
        [
            0.036575716413222256
        ], 
        [
            0.03078816471979022
        ], 
        [
            0.028990894760284575
        ], 
        [
            0.031929567315855528
        ], 
        [
            0.038891814236771315
        ], 
        [
            0.032028702288903296
        ], 
        [
            0.030933338267020882
        ], 
        [
            0.030182436773804947
        ], 
        [
            0.031532251402828844
        ], 
        [
            0.031101123873377219
        ], 
        [
            0.028591776031330229
        ], 
        [
            0.03052200262889266
        ], 
        [
            0.027678241423415021
        ], 
        [
            0.025358100361600518
        ], 
        [
            0.037670798579715191
        ], 
        [
            0.029098779817149045
        ], 
        [
            0.033200002649961972
        ], 
        [
            0.033131911530960352
        ], 
        [
            0.026324181764952374
        ], 
        [
            0.03763538835884072
        ], 
        [
            0.026695343885142355
        ], 
        [
            0.030576867416603492
        ], 
        [
            0.030238571802480147
        ], 
        [
            0.030760633493820206
        ], 
        [
            0.02690796396078542
        ], 
        [
            0.030525195626253263
        ], 
        [
            0.02942658321769908
        ], 
        [
            0.031879280954399146
        ], 
        [
            0.024296141913784666
        ], 
        [
            0.024139728190032766
        ], 
        [
            0.031676219902728918
        ], 
        [
            0.034348623255318962
        ]
    ], 
    "val_accs": [
        [
            0.58819999999999995
        ], 
        [
            0.67649999999999999
        ], 
        [
            0.71860000000000002
        ], 
        [
            0.73409999999999997
        ], 
        [
            0.74990000000000001
        ], 
        [
            0.74550000000000005
        ], 
        [
            0.75329999999999997
        ], 
        [
            0.76359999999999995
        ], 
        [
            0.77439999999999998
        ], 
        [
            0.76270000000000004
        ], 
        [
            0.76570000000000005
        ], 
        [
            0.75760000000000005
        ], 
        [
            0.76280000000000003
        ], 
        [
            0.76219999999999999
        ], 
        [
            0.76080000000000003
        ], 
        [
            0.76559999999999995
        ], 
        [
            0.76370000000000005
        ], 
        [
            0.77059999999999995
        ], 
        [
            0.76419999999999999
        ], 
        [
            0.7591
        ], 
        [
            0.75390000000000001
        ], 
        [
            0.76770000000000005
        ], 
        [
            0.76229999999999998
        ], 
        [
            0.75819999999999999
        ], 
        [
            0.75439999999999996
        ], 
        [
            0.7671
        ], 
        [
            0.76190000000000002
        ], 
        [
            0.76070000000000004
        ], 
        [
            0.76280000000000003
        ], 
        [
            0.76139999999999997
        ], 
        [
            0.76619999999999999
        ], 
        [
            0.76400000000000001
        ], 
        [
            0.76290000000000002
        ], 
        [
            0.76670000000000005
        ], 
        [
            0.73909999999999998
        ], 
        [
            0.75749999999999995
        ], 
        [
            0.75629999999999997
        ], 
        [
            0.75680000000000003
        ], 
        [
            0.75580000000000003
        ], 
        [
            0.76280000000000003
        ], 
        [
            0.74850000000000005
        ], 
        [
            0.75800000000000001
        ], 
        [
            0.76390000000000002
        ], 
        [
            0.76370000000000005
        ], 
        [
            0.76300000000000001
        ], 
        [
            0.76259999999999994
        ], 
        [
            0.76000000000000001
        ], 
        [
            0.76119999999999999
        ], 
        [
            0.7651
        ], 
        [
            0.75160000000000005
        ], 
        [
            0.76370000000000005
        ], 
        [
            0.76129999999999998
        ], 
        [
            0.75760000000000005
        ], 
        [
            0.76039999999999996
        ], 
        [
            0.76319999999999999
        ], 
        [
            0.76359999999999995
        ], 
        [
            0.76029999999999998
        ], 
        [
            0.7671
        ], 
        [
            0.75849999999999995
        ], 
        [
            0.76139999999999997
        ], 
        [
            0.75319999999999998
        ], 
        [
            0.75600000000000001
        ], 
        [
            0.76090000000000002
        ], 
        [
            0.7591
        ], 
        [
            0.75700000000000001
        ], 
        [
            0.75339999999999996
        ], 
        [
            0.75919999999999999
        ], 
        [
            0.75790000000000002
        ], 
        [
            0.76219999999999999
        ], 
        [
            0.75790000000000002
        ], 
        [
            0.76359999999999995
        ], 
        [
            0.75329999999999997
        ], 
        [
            0.76259999999999994
        ], 
        [
            0.76080000000000003
        ], 
        [
            0.75760000000000005
        ], 
        [
            0.76000000000000001
        ], 
        [
            0.76629999999999998
        ], 
        [
            0.74990000000000001
        ], 
        [
            0.76480000000000004
        ], 
        [
            0.76049999999999995
        ], 
        [
            0.75529999999999997
        ], 
        [
            0.75439999999999996
        ], 
        [
            0.7631
        ], 
        [
            0.76439999999999997
        ], 
        [
            0.76049999999999995
        ], 
        [
            0.75570000000000004
        ], 
        [
            0.75990000000000002
        ], 
        [
            0.7601
        ], 
        [
            0.76659999999999995
        ], 
        [
            0.7621
        ], 
        [
            0.76619999999999999
        ], 
        [
            0.75929999999999997
        ], 
        [
            0.76049999999999995
        ], 
        [
            0.76139999999999997
        ], 
        [
            0.75839999999999996
        ], 
        [
            0.76290000000000002
        ], 
        [
            0.75349999999999995
        ], 
        [
            0.76629999999999998
        ], 
        [
            0.7621
        ], 
        [
            0.77170000000000005
        ], 
        [
            0.76090000000000002
        ], 
        [
            0.76749999999999996
        ], 
        [
            0.76490000000000002
        ], 
        [
            0.75980000000000003
        ], 
        [
            0.75619999999999998
        ], 
        [
            0.7621
        ], 
        [
            0.75829999999999997
        ], 
        [
            0.76190000000000002
        ], 
        [
            0.76119999999999999
        ], 
        [
            0.7601
        ], 
        [
            0.76200000000000001
        ], 
        [
            0.76170000000000004
        ], 
        [
            0.76290000000000002
        ], 
        [
            0.76270000000000004
        ], 
        [
            0.7641
        ], 
        [
            0.755
        ], 
        [
            0.76649999999999996
        ], 
        [
            0.76990000000000003
        ], 
        [
            0.75749999999999995
        ], 
        [
            0.76270000000000004
        ], 
        [
            0.76549999999999996
        ], 
        [
            0.76060000000000005
        ], 
        [
            0.76529999999999998
        ], 
        [
            0.76700000000000002
        ], 
        [
            0.75539999999999996
        ], 
        [
            0.75749999999999995
        ], 
        [
            0.76290000000000002
        ], 
        [
            0.76370000000000005
        ], 
        [
            0.76900000000000002
        ], 
        [
            0.7601
        ], 
        [
            0.76349999999999996
        ], 
        [
            0.76060000000000005
        ], 
        [
            0.76459999999999995
        ], 
        [
            0.76480000000000004
        ], 
        [
            0.76839999999999997
        ], 
        [
            0.7631
        ], 
        [
            0.76349999999999996
        ], 
        [
            0.76680000000000004
        ], 
        [
            0.7611
        ], 
        [
            0.76329999999999998
        ], 
        [
            0.76049999999999995
        ], 
        [
            0.76370000000000005
        ], 
        [
            0.76459999999999995
        ], 
        [
            0.75690000000000002
        ], 
        [
            0.76700000000000002
        ], 
        [
            0.75870000000000004
        ], 
        [
            0.76600000000000001
        ], 
        [
            0.76129999999999998
        ], 
        [
            0.76639999999999997
        ], 
        [
            0.76100000000000001
        ], 
        [
            0.76519999999999999
        ], 
        [
            0.75600000000000001
        ], 
        [
            0.76400000000000001
        ], 
        [
            0.76600000000000001
        ], 
        [
            0.75780000000000003
        ], 
        [
            0.76100000000000001
        ], 
        [
            0.76439999999999997
        ], 
        [
            0.76690000000000003
        ], 
        [
            0.76659999999999995
        ], 
        [
            0.75770000000000004
        ], 
        [
            0.7661
        ], 
        [
            0.76590000000000003
        ], 
        [
            0.76049999999999995
        ], 
        [
            0.75590000000000002
        ], 
        [
            0.75960000000000005
        ], 
        [
            0.77049999999999996
        ], 
        [
            0.76649999999999996
        ], 
        [
            0.76270000000000004
        ], 
        [
            0.76700000000000002
        ], 
        [
            0.76400000000000001
        ], 
        [
            0.75860000000000005
        ], 
        [
            0.75380000000000003
        ], 
        [
            0.76539999999999997
        ], 
        [
            0.76429999999999998
        ], 
        [
            0.76080000000000003
        ], 
        [
            0.75690000000000002
        ], 
        [
            0.76280000000000003
        ], 
        [
            0.76580000000000004
        ], 
        [
            0.76219999999999999
        ], 
        [
            0.76049999999999995
        ], 
        [
            0.76129999999999998
        ], 
        [
            0.76449999999999996
        ], 
        [
            0.76249999999999996
        ], 
        [
            0.76519999999999999
        ], 
        [
            0.76090000000000002
        ], 
        [
            0.76019999999999999
        ], 
        [
            0.75529999999999997
        ], 
        [
            0.76100000000000001
        ], 
        [
            0.76729999999999998
        ], 
        [
            0.76280000000000003
        ], 
        [
            0.76300000000000001
        ], 
        [
            0.76480000000000004
        ], 
        [
            0.75800000000000001
        ], 
        [
            0.7631
        ], 
        [
            0.76539999999999997
        ], 
        [
            0.76329999999999998
        ], 
        [
            0.76229999999999998
        ], 
        [
            0.76390000000000002
        ], 
        [
            0.76229999999999998
        ], 
        [
            0.76139999999999997
        ]
    ], 
    "val_losses": [
        [
            1.1425374509811401
        ], 
        [
            0.90510018520355229
        ], 
        [
            0.80907459697723394
        ], 
        [
            0.7663041580200195
        ], 
        [
            0.72771226234436037
        ], 
        [
            0.75570752267837527
        ], 
        [
            0.73914879417419432
        ], 
        [
            0.7387716917991638
        ], 
        [
            0.75832362098693851
        ], 
        [
            0.83451470479965206
        ], 
        [
            0.88470397186279293
        ], 
        [
            0.89930747785568232
        ], 
        [
            0.99466246376037593
        ], 
        [
            1.0010716272354125
        ], 
        [
            1.0045213258743286
        ], 
        [
            1.0421128440856933
        ], 
        [
            1.0881482069015502
        ], 
        [
            1.0592869937896729
        ], 
        [
            1.1711068801879883
        ], 
        [
            1.1624373426437378
        ], 
        [
            1.187402826499939
        ], 
        [
            1.1717134857177733
        ], 
        [
            1.1962042713165284
        ], 
        [
            1.25410555229187
        ], 
        [
            1.3286774965286254
        ], 
        [
            1.2474149293899537
        ], 
        [
            1.2363527326583863
        ], 
        [
            1.2314371290206909
        ], 
        [
            1.2870894952774048
        ], 
        [
            1.3124270185470581
        ], 
        [
            1.2476176959991454
        ], 
        [
            1.2955979368209838
        ], 
        [
            1.2800562860488891
        ], 
        [
            1.3003009358406068
        ], 
        [
            1.5673675281524657
        ], 
        [
            1.3359239334106445
        ], 
        [
            1.3138108982086181
        ], 
        [
            1.3433437103271484
        ], 
        [
            1.4164937812805176
        ], 
        [
            1.3684891132354737
        ], 
        [
            1.5291401565551759
        ], 
        [
            1.4607196472167969
        ], 
        [
            1.36709008102417
        ], 
        [
            1.4250312551498414
        ], 
        [
            1.3559155395507811
        ], 
        [
            1.3569498117446899
        ], 
        [
            1.4963166908264161
        ], 
        [
            1.376651209640503
        ], 
        [
            1.4199516212463379
        ], 
        [
            1.5019056856155395
        ], 
        [
            1.4012048648834228
        ], 
        [
            1.4960418544769287
        ], 
        [
            1.5505734527587891
        ], 
        [
            1.4278498023986816
        ], 
        [
            1.4012906936645508
        ], 
        [
            1.505960599899292
        ], 
        [
            1.4973084865570068
        ], 
        [
            1.4430205333709716
        ], 
        [
            1.4876139129638672
        ], 
        [
            1.4520751502990723
        ], 
        [
            1.5802280017852783
        ], 
        [
            1.5283640293121339
        ], 
        [
            1.4393778366088867
        ], 
        [
            1.5268164268493651
        ], 
        [
            1.5560076709747315
        ], 
        [
            1.583728518295288
        ], 
        [
            1.4993703620910646
        ], 
        [
            1.5321731163024903
        ], 
        [
            1.5201689804077148
        ], 
        [
            1.5503432704925537
        ], 
        [
            1.5317274478912353
        ], 
        [
            1.5918968055725098
        ], 
        [
            1.5753529098510741
        ], 
        [
            1.5923219017028809
        ], 
        [
            1.6017812496185302
        ], 
        [
            1.6010056655883789
