{
    "batch_size": 128, 
    "class_name": "Model", 
    "config": {
        "input_layers": [
            [
                "input", 
                0, 
                0
            ]
        ], 
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "batch_input_shape": [
                        null, 
                        3, 
                        32, 
                        32
                    ], 
                    "input_dtype": "float32", 
                    "name": "input", 
                    "sparse": false
                }, 
                "inbound_nodes": [], 
                "name": "input"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_5", 
                    "nb_col": 3, 
                    "nb_filter": 32, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "input", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_5"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_5", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_5", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_5"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_6", 
                    "nb_col": 3, 
                    "nb_filter": 32, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_5", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_6"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_6", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_6", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_6"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "border_mode": "valid", 
                    "dim_ordering": "th", 
                    "name": "maxpooling2d_3", 
                    "pool_size": [
                        2, 
                        2
                    ], 
                    "strides": [
                        2, 
                        2
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_6", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "maxpooling2d_3"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "name": "dropout_3", 
                    "p": 0.25, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "maxpooling2d_3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dropout_3"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_7", 
                    "nb_col": 3, 
                    "nb_filter": 64, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dropout_3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_7"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_7", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_7", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_7"
            }, 
            {
                "class_name": "Convolution2D", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": {
                        "l1": 0.0, 
                        "l2": 0.0, 
                        "name": "WeightRegularizer"
                    }, 
                    "activation": "linear", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "border_mode": "same", 
                    "dim_ordering": "th", 
                    "init": "glorot_uniform", 
                    "name": "convolution2d_8", 
                    "nb_col": 3, 
                    "nb_filter": 64, 
                    "nb_row": 3, 
                    "subsample": [
                        1, 
                        1
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_7", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution2d_8"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "name": "activation_8", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution2d_8", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_8"
            }, 
            {
                "class_name": "MaxPooling2D", 
                "config": {
                    "border_mode": "valid", 
                    "dim_ordering": "th", 
                    "name": "maxpooling2d_4", 
                    "pool_size": [
                        2, 
                        2
                    ], 
                    "strides": [
                        2, 
                        2
                    ], 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_8", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "maxpooling2d_4"
            }, 
            {
                "class_name": "Dropout", 
                "config": {
                    "name": "dropout_4", 
                    "p": 0.25, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "maxpooling2d_4", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dropout_4"
            }, 
            {
                "class_name": "Flatten", 
                "config": {
                    "name": "flatten_2", 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dropout_4", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "flatten_2"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": null, 
                    "activation": "relu", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "init": "glorot_uniform", 
                    "input_dim": null, 
                    "name": "dense_3", 
                    "output_dim": 512, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "flatten_2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dense_3"
            }, 
            {
                "class_name": "Dense", 
                "config": {
                    "W_constraint": null, 
                    "W_regularizer": null, 
                    "activation": "softmax", 
                    "activity_regularizer": null, 
                    "b_constraint": null, 
                    "b_regularizer": null, 
                    "bias": true, 
                    "init": "glorot_uniform", 
                    "input_dim": null, 
                    "name": "dense_4", 
                    "output_dim": 10, 
                    "trainable": true
                }, 
                "inbound_nodes": [
                    [
                        [
                            "dense_3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "dense_4"
            }
        ], 
        "name": "CNN", 
        "output_layers": [
            [
                "dense_4", 
                0, 
                0
            ]
        ]
    }, 
    "experiment_name": "SGD", 
    "img_dim": [
        3, 
        32, 
        32
    ], 
    "keras_version": "1.1.0", 
    "nb_epoch": 200, 
    "optimizer": {
        "decay": 0.0, 
        "lr": 0.0010000000474974513, 
        "momentum": 0.8999999761581421, 
        "nesterov": true
    }, 
    "train_accs": [
        [
            0.17679999998092652
        ], 
        [
            0.30631999999046328
        ], 
        [
            0.36909999998092652
        ], 
        [
            0.41715999998092651
        ], 
        [
            0.44383999998092649
        ], 
        [
            0.46636
        ], 
        [
            0.48809999999999998
        ], 
        [
            0.50428000001907347
        ], 
        [
            0.52161999999046327
        ], 
        [
            0.53755999998092652
        ], 
        [
            0.5512800000095367
        ], 
        [
            0.56322000001907346
        ], 
        [
            0.57398000000000005
        ], 
        [
            0.58559999998092649
        ], 
        [
            0.59993999998092651
        ], 
        [
            0.60761999998092653
        ], 
        [
            0.61907999998092655
        ], 
        [
            0.62875999998092647
        ], 
        [
            0.64010000003814693
        ], 
        [
            0.64915999996185303
        ], 
        [
            0.65703999999999996
        ], 
        [
            0.66639999996185306
        ], 
        [
            0.6744
        ], 
        [
            0.67925999999999997
        ], 
        [
            0.68900000001907347
        ], 
        [
            0.69388000000000005
        ], 
        [
            0.69950000000000001
        ], 
        [
            0.70684000000000002
        ], 
        [
            0.71354000003814699
        ], 
        [
            0.71689999999999998
        ], 
        [
            0.72191999998092649
        ], 
        [
            0.72874000003814698
        ], 
        [
            0.73104000003814695
        ], 
        [
            0.73734000001907352
        ], 
        [
            0.7419
        ], 
        [
            0.74883999996185302
        ], 
        [
            0.75316000003814698
        ], 
        [
            0.75715999998092653
        ], 
        [
            0.76343999996185308
        ], 
        [
            0.76519999996185306
        ], 
        [
            0.77071999996185303
        ], 
        [
            0.77746000003814697
        ], 
        [
            0.78032000001907353
        ], 
        [
            0.783899999961853
        ], 
        [
            0.7910999999809265
        ], 
        [
            0.79398000003814695
        ], 
        [
            0.79955999998092653
        ], 
        [
            0.80224000001907347
        ], 
        [
            0.80746000001907348
        ], 
        [
            0.81296000000000002
        ], 
        [
            0.81580000001907349
        ], 
        [
            0.819759999961853
        ], 
        [
            0.82449999998092649
        ], 
        [
            0.83196000001907344
        ], 
        [
            0.83708000001907346
        ], 
        [
            0.83995999998092652
        ], 
        [
            0.84190000003814702
        ], 
        [
            0.84660000001907354
        ], 
        [
            0.8508199999809265
        ], 
        [
            0.85277999998092646
        ], 
        [
            0.86088000003814702
        ], 
        [
            0.86462000003814699
        ], 
        [
            0.86509999998092646
        ], 
        [
            0.87225999996185299
        ], 
        [
            0.87334000000000001
        ], 
        [
            0.87875999996185306
        ], 
        [
            0.88021999998092648
        ], 
        [
            0.88397999999999999
        ], 
        [
            0.88808000003814702
        ], 
        [
            0.89337999999999995
        ], 
        [
            0.89569999996185301
        ], 
        [
            0.89571999998092655
        ], 
        [
            0.90332000003814694
        ], 
        [
            0.90518000003814703
        ], 
        [
            0.90866000001907343
        ], 
        [
            0.91079999998092653
        ], 
        [
            0.91542000003814694
        ], 
        [
            0.91851999998092648
        ], 
        [
            0.91805999999999999
        ], 
        [
            0.92266000003814697
        ], 
        [
            0.92501999998092654
        ], 
        [
            0.92896000001907353
        ], 
        [
            0.92851999998092649
        ], 
        [
            0.93131999998092652
        ], 
        [
            0.93406000003814693
        ], 
        [
            0.93620000003814696
        ], 
        [
            0.93616000001907351
        ], 
        [
            0.93974000003814695
        ], 
        [
            0.94083999996185308
        ], 
        [
            0.94541999998092652
        ], 
        [
            0.945780000038147
        ], 
        [
            0.94674000003814696
        ], 
        [
            0.94833999999999996
        ], 
        [
            0.95084000003814695
        ], 
        [
            0.95133999998092655
        ], 
        [
            0.95357999999999998
        ], 
        [
            0.95389999998092656
        ], 
        [
            0.95595999996185299
        ], 
        [
            0.95631999998092654
        ], 
        [
            0.95863999998092653
        ], 
        [
            0.95932000001907347
        ], 
        [
            0.96147999996185307
        ], 
        [
            0.96313999996185307
        ], 
        [
            0.96431999999999995
        ], 
        [
            0.96436000003814693
        ], 
        [
            0.96508000001907346
        ], 
        [
            0.96467999998092646
        ], 
        [
            0.96736000001907352
        ], 
        [
            0.96647999996185308
        ], 
        [
            0.96822000001907349
        ], 
        [
            0.96971999998092651
        ], 
        [
            0.969540000038147
        ], 
        [
            0.97056000003814702
        ], 
        [
            0.97222000003814701
        ], 
        [
            0.97211999998092646
        ], 
        [
            0.97248000000000001
        ], 
        [
            0.97312000001907351
        ], 
        [
            0.97471999996185299
        ], 
        [
            0.97407999999999995
        ], 
        [
            0.97503999996185298
        ], 
        [
            0.97696000003814698
        ], 
        [
            0.9750399999809265
        ], 
        [
            0.97563999999999995
        ], 
        [
            0.97686000001907347
        ], 
        [
            0.97870000003814694
        ], 
        [
            0.97741999998092655
        ], 
        [
            0.97789999996185306
        ], 
        [
            0.97873999996185301
        ], 
        [
            0.97806000000000004
        ], 
        [
            0.97990000001907351
        ], 
        [
            0.97934000001907351
        ], 
        [
            0.97952000003814699
        ], 
        [
            0.9802599999809265
        ], 
        [
            0.97921999998092646
        ], 
        [
            0.981279999961853
        ], 
        [
            0.98180000003814694
        ], 
        [
            0.98184000000000005
        ], 
        [
            0.98279999996185308
        ], 
        [
            0.98275999999999997
        ], 
        [
            0.98202000003814693
        ], 
        [
            0.98308000003814699
        ], 
        [
            0.98274000001907347
        ], 
        [
            0.9844400000190735
        ], 
        [
            0.98382000003814696
        ], 
        [
            0.98458000001907353
        ], 
        [
            0.984420000038147
        ], 
        [
            0.98569999996185298
        ], 
        [
            0.9849
        ], 
        [
            0.98573999999999995
        ], 
        [
            0.9849
        ], 
        [
            0.98463999999999996
        ], 
        [
            0.98530000001907347
        ], 
        [
            0.98648000001907343
        ], 
        [
            0.98708000001907348
        ], 
        [
            0.98638000001907344
        ], 
        [
            0.98646
        ], 
        [
            0.98683999996185301
        ], 
        [
            0.98802000003814694
        ], 
        [
            0.98709999999999998
        ], 
        [
            0.98736000003814695
        ], 
        [
            0.98762000000000005
        ], 
        [
            0.98774000003814699
        ], 
        [
            0.98770000001907343
        ], 
        [
            0.98812
        ], 
        [
            0.98763999999999996
        ], 
        [
            0.98836000000000002
        ], 
        [
            0.98832000003814702
        ], 
        [
            0.98758000003814694
        ], 
        [
            0.98914000003814695
        ], 
        [
            0.98852000001907347
        ], 
        [
            0.98780000003814694
        ], 
        [
            0.98960000000000004
        ], 
        [
            0.98935999996185298
        ], 
        [
            0.98980000000000001
        ], 
        [
            0.98958000000000002
        ], 
        [
            0.99016000000000004
        ], 
        [
            0.98948000000000003
        ], 
        [
            0.98919999999999997
        ], 
        [
            0.9891000000190735
        ], 
        [
            0.98965999999999998
        ], 
        [
            0.99050000001907346
        ], 
        [
            0.99012
        ], 
        [
            0.99026000001907344
        ], 
        [
            0.98897999996185304
        ], 
        [
            0.98894000003814697
        ], 
        [
            0.99056
        ], 
        [
            0.99094000000000004
        ], 
        [
            0.99051999999999996
        ], 
        [
            0.99090000003814693
        ], 
        [
            0.99077999996185306
        ], 
        [
            0.99095999999999995
        ], 
        [
            0.99122000001907351
        ], 
        [
            0.99226000001907344
        ], 
        [
            0.99150000000000005
        ], 
        [
            0.99144000001907351
        ], 
        [
            0.99160000000000004
        ], 
        [
            0.99138000001907345
        ], 
        [
            0.99239999999999995
        ], 
        [
            0.99236000001907354
        ], 
        [
            0.99206000000000005
        ]
    ], 
    "train_losses": [
        [
            2.2081653730773927
        ], 
        [
            1.9360285497665406
        ], 
        [
            1.7711477603530883
        ], 
        [
            1.6299378955841064
        ], 
        [
            1.5452345530319214
        ], 
        [
            1.4847806573104858
        ], 
        [
            1.4224556798934938
        ], 
        [
            1.3755584136962891
        ], 
        [
            1.3343768069839477
        ], 
        [
            1.2958756289291382
        ], 
        [
            1.2634756606674193
        ], 
        [
            1.2316034098815918
        ], 
        [
            1.1985534545898437
        ], 
        [
            1.1661031532287598
        ], 
        [
            1.1360333713150024
        ], 
        [
            1.1099599545669556
        ], 
        [
            1.0798442647933959
        ], 
        [
            1.0534854130554199
        ], 
        [
            1.0249385794067383
        ], 
        [
            1.0007142698860167
        ], 
        [
            0.97984400697708129
        ], 
        [
            0.95533268615722655
        ], 
        [
            0.93773179933547979
        ], 
        [
            0.91456304967880253
        ], 
        [
            0.89445559236526484
        ], 
        [
            0.87794841413497926
        ], 
        [
            0.85880018404006953
        ], 
        [
            0.84400026554107666
        ], 
        [
            0.82844022420883179
        ], 
        [
            0.81276142505645754
        ], 
        [
            0.79714385511398311
        ], 
        [
            0.78041766683578495
        ], 
        [
            0.76853768316268922
        ], 
        [
            0.75311837955474858
        ], 
        [
            0.74015630331039428
        ], 
        [
            0.72335097637176515
        ], 
        [
            0.7100939647483826
        ], 
        [
            0.69614141782760619
        ], 
        [
            0.6814550806236267
        ], 
        [
            0.670931614818573
        ], 
        [
            0.65491748500823976
        ], 
        [
            0.63993566083908082
        ], 
        [
            0.6311781265258789
        ], 
        [
            0.6151910985088348
        ], 
        [
            0.59608137752532964
        ], 
        [
            0.59335751723289487
        ], 
        [
            0.57419725660324095
        ], 
        [
            0.56268601928710937
        ], 
        [
            0.54863527588844296
        ], 
        [
            0.53808465482711787
        ], 
        [
            0.5241677995967865
        ], 
        [
            0.51219369173049922
        ], 
        [
            0.49849902098655702
        ], 
        [
            0.4821303611278534
        ], 
        [
            0.4698486054420471
        ], 
        [
            0.45831863645553589
        ], 
        [
            0.44820330220222471
        ], 
        [
            0.43621972720146179
        ], 
        [
            0.4208180412387848
        ], 
        [
            0.41815393148422242
        ], 
        [
            0.40021465302467346
        ], 
        [
            0.38977048475265502
        ], 
        [
            0.38052030551910399
        ], 
        [
            0.36505623450279234
        ], 
        [
            0.35789235409736631
        ], 
        [
            0.34399051551818849
        ], 
        [
            0.33594072646141054
        ], 
        [
            0.32850309432029723
        ], 
        [
            0.31609100610733032
        ], 
        [
            0.30309897814750669
        ], 
        [
            0.29485788458824158
        ], 
        [
            0.28951867328643799
        ], 
        [
            0.27254856842041014
        ], 
        [
            0.26583619575500489
        ], 
        [
            0.25771716418266294
        ], 
        [
            0.24792761057376861
        ], 
        [
            0.2394761231994629
        ], 
        [
            0.22764473310470582
        ], 
        [
            0.22853150941371916
        ], 
        [
            0.21830682090997697
        ], 
        [
            0.20932701969623566
        ], 
        [
            0.20009918396472931
        ], 
        [
            0.20099491686820983
        ], 
        [
            0.19207453102588654
        ], 
        [
            0.18376844165802003
        ], 
        [
            0.18030275854587555
        ], 
        [
            0.17664419587612151
        ], 
        [
            0.16894421429157258
        ], 
        [
            0.16483055739164351
        ], 
        [
            0.1563683259820938
        ], 
        [
            0.15463215881109238
        ], 
        [
            0.15102853257894516
        ], 
        [
            0.14617917061328889
        ], 
        [
            0.13745555555343628
        ], 
        [
            0.13787958346843721
        ], 
        [
            0.13030603325366974
        ], 
        [
            0.12984931627750396
        ], 
        [
            0.12370560565710068
        ], 
        [
            0.12291256954669952
        ], 
        [
            0.11903945040464402
        ], 
        [
            0.11512292771339416
        ], 
        [
            0.10805666573524475
        ], 
        [
            0.10389230994462967
        ], 
        [
            0.10230068102836609
        ], 
        [
            0.10088575881481171
        ], 
        [
            0.099698342698812489
        ], 
        [
            0.10044738308429718
        ], 
        [
            0.092433719615936286
        ], 
        [
            0.093855401976108546
        ], 
        [
            0.090953253399133682
        ], 
        [
            0.087779937086105347
        ], 
        [
            0.086927621403932565
        ], 
        [
            0.086036526527404789
        ], 
        [
            0.081051385128498077
        ], 
        [
            0.081105476055145259
        ], 
        [
            0.079473166151046756
        ], 
        [
            0.078660135474205015
        ], 
        [
            0.075136249020099646
        ], 
        [
            0.07503954905629158
        ], 
        [
            0.073053635654449459
        ], 
        [
            0.067755874428749086
        ], 
        [
            0.070896439015865328
        ], 
        [
            0.06962371266841888
        ], 
        [
            0.065514981359243399
        ], 
        [
            0.061558492281436922
        ], 
        [
            0.064325711758136755
        ], 
        [
            0.06294000902175903
        ], 
        [
            0.06189556889772415
        ], 
        [
            0.061421413568854333
        ], 
        [
            0.059481105111241342
        ], 
        [
            0.058807471120357516
        ], 
        [
            0.059173385434150697
        ], 
        [
            0.057800447416305543
        ], 
        [
            0.058832095637321474
        ], 
        [
            0.054894936145544054
        ], 
        [
            0.054490265545845032
        ], 
        [
            0.052449107967615129
        ], 
        [
            0.050376489155292511
        ], 
        [
            0.050205828956365585
        ], 
        [
            0.052774535239934924
        ], 
        [
            0.049286840164661408
        ], 
        [
            0.050370632132887838
        ], 
        [
            0.046065137830972672
        ], 
        [
            0.047495291415452959
        ], 
        [
            0.045125690314769748
        ], 
        [
            0.045902145473957059
        ], 
        [
            0.043105972884893415
        ], 
        [
            0.044505612788796424
        ], 
        [
            0.042715544032603504
        ], 
        [
            0.044301890546679497
        ], 
        [
            0.045218054101616147
        ], 
        [
            0.042154666698575018
        ], 
        [
            0.039941573061943056
        ], 
        [
            0.03813316305279732
        ], 
        [
            0.041162220935821531
        ], 
        [
            0.039250527573823926
        ], 
        [
            0.039398424781560901
        ], 
        [
            0.036322908416986467
        ], 
        [
            0.038487110510617498
        ], 
        [
            0.038114851630330085
        ], 
        [
            0.037386120317876338
        ], 
        [
            0.03712822483360767
        ], 
        [
            0.0352086928743124
        ], 
        [
            0.035101752430945633
        ], 
        [
            0.036260927765667438
        ], 
        [
            0.035331041065156457
        ], 
        [
            0.033941340782046317
        ], 
        [
            0.035158832876682283
        ], 
        [
            0.033876072794198991
        ], 
        [
            0.033206997506022455
        ], 
        [
            0.034874271974563602
        ], 
        [
            0.032454915695190427
        ], 
        [
            0.030994103322029114
        ], 
        [
            0.030478685535192489
        ], 
        [
            0.031568122121095658
        ], 
        [
            0.030276268196403982
        ], 
        [
            0.030581645592749118
        ], 
        [
            0.031716230753660202
        ], 
        [
            0.031079370610713957
        ], 
        [
            0.030425303085446359
        ], 
        [
            0.028032378838658334
        ], 
        [
            0.030249020137786867
        ], 
        [
            0.028887177049517633
        ], 
        [
            0.03058275909781456
        ], 
        [
            0.031377119607925413
        ], 
        [
            0.027950825769603251
        ], 
        [
            0.027328143962025642
        ], 
        [
            0.02763821512758732
        ], 
        [
            0.0271550302490592
        ], 
        [
            0.026185393782258034
        ], 
        [
            0.026219853199273349
        ], 
        [
            0.025244696894884108
        ], 
        [
            0.024115772812962531
        ], 
        [
            0.025293750410228969
        ], 
        [
            0.025294863204956056
        ], 
        [
            0.024538785036504269
        ], 
        [
            0.025331287364959716
        ], 
        [
            0.023278702577352525
        ], 
        [
            0.023156231805682184
        ], 
        [
            0.023593685591220857
        ]
    ], 
    "val_accs": [
        [
            0.28810000000000002
        ], 
        [
            0.37280000000000002
        ], 
        [
            0.41949999999999998
        ], 
        [
            0.4425
        ], 
        [
            0.47649999999999998
        ], 
        [
            0.49009999999999998
        ], 
        [
            0.51539999999999997
        ], 
        [
            0.53600000000000003
        ], 
        [
            0.54169999999999996
        ], 
        [
            0.56230000000000002
        ], 
        [
            0.57040000000000002
        ], 
        [
            0.58289999999999997
        ], 
        [
            0.58819999999999995
        ], 
        [
            0.60709999999999997
        ], 
        [
            0.61050000000000004
        ], 
        [
            0.62829999999999997
        ], 
        [
            0.64259999999999995
        ], 
        [
            0.65080000000000005
        ], 
        [
            0.65369999999999995
        ], 
        [
            0.66659999999999997
        ], 
        [
            0.67069999999999996
        ], 
        [
            0.67659999999999998
        ], 
        [
            0.67730000000000001
        ], 
        [
            0.68259999999999998
        ], 
        [
            0.68820000000000003
        ], 
        [
            0.69230000000000003
        ], 
        [
            0.69999999999999996
        ], 
        [
            0.70520000000000005
        ], 
        [
            0.70540000000000003
        ], 
        [
            0.7107
        ], 
        [
            0.71399999999999997
        ], 
        [
            0.71679999999999999
        ], 
        [
            0.72040000000000004
        ], 
        [
            0.72050000000000003
        ], 
        [
            0.72189999999999999
        ], 
        [
            0.7298
        ], 
        [
            0.73219999999999996
        ], 
        [
            0.73419999999999996
        ], 
        [
            0.73170000000000002
        ], 
        [
            0.73619999999999997
        ], 
        [
            0.74019999999999997
        ], 
        [
            0.74329999999999996
        ], 
        [
            0.74709999999999999
        ], 
        [
            0.74850000000000005
        ], 
        [
            0.74560000000000004
        ], 
        [
            0.74970000000000003
        ], 
        [
            0.752
        ], 
        [
            0.74909999999999999
        ], 
        [
            0.75309999999999999
        ], 
        [
            0.755
        ], 
        [
            0.75749999999999995
        ], 
        [
            0.75929999999999997
        ], 
        [
            0.76100000000000001
        ], 
        [
            0.75700000000000001
        ], 
        [
            0.75980000000000003
        ], 
        [
            0.7591
        ], 
        [
            0.76019999999999999
        ], 
        [
            0.75739999999999996
        ], 
        [
            0.76270000000000004
        ], 
        [
            0.76280000000000003
        ], 
        [
            0.76160000000000005
        ], 
        [
            0.76359999999999995
        ], 
        [
            0.76290000000000002
        ], 
        [
            0.76239999999999997
        ], 
        [
            0.76419999999999999
        ], 
        [
            0.76780000000000004
        ], 
        [
            0.76100000000000001
        ], 
        [
            0.76680000000000004
        ], 
        [
            0.7681
        ], 
        [
            0.76759999999999995
        ], 
        [
            0.76659999999999995
        ], 
        [
            0.7681
        ], 
        [
            0.76959999999999995
        ], 
        [
            0.76949999999999996
        ], 
        [
            0.76649999999999996
        ], 
        [
            0.76570000000000005
        ], 
        [
            0.76819999999999999
        ], 
        [
            0.76790000000000003
        ], 
        [
            0.76970000000000005
        ], 
        [
            0.76980000000000004
        ], 
        [
            0.77210000000000001
        ], 
        [
            0.76990000000000003
        ], 
        [
            0.77070000000000005
        ], 
        [
            0.76870000000000005
        ], 
        [
            0.77090000000000003
        ], 
        [
            0.77329999999999999
        ], 
        [
            0.77390000000000003
        ], 
        [
            0.7742
        ], 
        [
            0.77290000000000003
        ], 
        [
            0.77529999999999999
        ], 
        [
            0.77339999999999998
        ], 
        [
            0.7702
        ], 
        [
            0.77510000000000001
        ], 
        [
            0.76900000000000002
        ], 
        [
            0.77529999999999999
        ], 
        [
            0.76990000000000003
        ], 
        [
            0.77110000000000001
        ], 
        [
            0.77129999999999999
        ], 
        [
            0.7732
        ], 
        [
            0.76749999999999996
        ], 
        [
            0.77300000000000002
        ], 
        [
            0.77759999999999996
        ], 
        [
            0.77159999999999995
        ], 
        [
            0.77439999999999998
        ], 
        [
            0.76970000000000005
        ], 
        [
            0.77139999999999997
        ], 
        [
            0.77159999999999995
        ], 
        [
            0.77259999999999995
        ], 
        [
            0.77510000000000001
        ], 
        [
            0.76790000000000003
        ], 
        [
            0.77439999999999998
        ], 
        [
            0.77070000000000005
        ], 
        [
            0.76880000000000004
        ], 
        [
            0.77470000000000006
        ], 
        [
            0.7732
        ], 
        [
            0.77270000000000005
        ], 
        [
            0.77449999999999997
        ], 
        [
            0.77470000000000006
        ], 
        [
            0.77559999999999996
        ], 
        [
            0.77529999999999999
        ], 
        [
            0.77610000000000001
        ], 
        [
            0.77259999999999995
        ], 
        [
            0.7732
        ], 
        [
            0.77410000000000001
        ], 
        [
            0.77339999999999998
        ], 
        [
            0.77139999999999997
        ], 
        [
            0.77390000000000003
        ], 
        [
            0.77659999999999996
        ], 
        [
            0.77690000000000003
        ], 
        [
            0.77729999999999999
        ], 
        [
            0.77600000000000002
        ], 
        [
            0.77200000000000002
        ], 
        [
            0.77539999999999998
        ], 
        [
            0.7712
        ], 
        [
            0.77429999999999999
        ], 
        [
            0.77429999999999999
        ], 
        [
            0.77270000000000005
        ], 
        [
            0.77600000000000002
        ], 
        [
            0.77490000000000003
        ], 
        [
            0.77610000000000001
        ], 
        [
            0.77490000000000003
        ], 
        [
            0.77280000000000004
        ], 
        [
            0.77380000000000004
        ], 
        [
            0.77739999999999998
        ], 
        [
            0.77669999999999995
        ], 
        [
            0.7732
        ], 
        [
            0.7802
        ], 
        [
            0.7762
        ], 
        [
            0.77739999999999998
        ], 
        [
            0.77480000000000004
        ], 
        [
            0.77969999999999995
        ], 
        [
            0.77800000000000002
        ], 
        [
            0.77370000000000005
        ], 
        [
            0.77869999999999995
        ], 
        [
            0.77710000000000001
        ], 
        [
            0.77649999999999997
        ], 
        [
            0.77700000000000002
        ], 
        [
            0.77839999999999998
        ], 
        [
            0.77370000000000005
        ], 
        [
            0.77600000000000002
        ], 
        [
            0.77510000000000001
        ], 
        [
            0.7742
        ], 
        [
            0.77480000000000004
        ], 
        [
            0.77539999999999998
        ], 
        [
            0.7752
        ], 
        [
            0.77610000000000001
        ], 
        [
            0.77790000000000004
        ], 
        [
            0.77510000000000001
        ], 
        [
            0.77480000000000004
        ], 
        [
            0.77480000000000004
        ], 
        [
            0.77500000000000002
        ], 
        [
            0.77380000000000004
        ], 
        [
            0.77580000000000005
        ], 
        [
            0.7772
        ], 
        [
            0.77690000000000003
        ], 
        [
            0.77590000000000003
        ], 
        [
            0.77849999999999997
        ], 
        [
            0.77810000000000001
        ], 
        [
            0.77439999999999998
        ], 
        [
            0.77649999999999997
        ], 
        [
            0.7782
        ], 
        [
            0.78000000000000003
        ], 
        [
            0.77629999999999999
        ], 
        [
            0.7782
        ], 
        [
            0.77729999999999999
        ], 
        [
            0.78120000000000001
        ], 
        [
            0.77790000000000004
        ], 
        [
            0.77390000000000003
        ], 
        [
            0.77780000000000005
        ], 
        [
            0.77769999999999995
        ], 
        [
            0.77639999999999998
        ], 
        [
            0.77810000000000001
        ], 
        [
            0.78249999999999997
        ], 
        [
            0.7772
        ], 
        [
            0.78190000000000004
        ], 
        [
            0.77859999999999996
        ], 
        [
            0.78049999999999997
        ], 
        [
            0.78000000000000003
        ], 
        [
            0.78149999999999997
        ], 
        [
            0.77510000000000001
        ]
    ], 
    "val_losses": [
        [
            2.002192499923706
        ], 
        [
            1.8230559453964232
        ], 
        [
            1.6344158351898193
        ], 
        [
            1.564348295402527
        ], 
        [
            1.4658354637145996
        ], 
        [
            1.4147891107559205
        ], 
        [
            1.3582631404876708
        ], 
        [
            1.3010034893035889
        ], 
        [
            1.2711994657516479
        ], 
        [
            1.2296171909332276
        ], 
        [
            1.2075567665100098
        ], 
        [
            1.1696675045013427
        ], 
        [
            1.157291114807129
        ], 
        [
            1.1133068086624145
        ], 
        [
            1.0968664681434632
        ], 
        [
            1.0547036289215088
        ], 
        [
            1.0289581789970399
        ], 
        [
            1.0019560551643372
        ], 
        [
            0.99506994361877443
        ], 
        [
            0.9598126773834228
        ], 
        [
            0.94267788705825806
        ], 
        [
            0.92357171554565431
        ], 
        [
            0.91833883705139163
        ], 
        [
            0.90807108421325688
        ], 
        [
            0.89494062776565553
        ], 
        [
            0.87735334129333498
        ], 
        [
            0.85677228717803955
        ], 
        [
            0.84252310695648192
        ], 
        [
            0.83374481697082514
        ], 
        [
            0.82648765811920166
        ], 
        [
            0.81936293563842777
        ], 
        [
            0.80954225578308103
        ], 
        [
            0.79626428651809689
        ], 
        [
            0.80145237483978271
        ], 
        [
            0.80153990287780763
        ], 
        [
            0.77379156608581545
        ], 
        [
            0.766418347454071
        ], 
        [
            0.75912934417724609
        ], 
        [
            0.77416019744873044
        ], 
        [
            0.76249733257293706
        ], 
        [
            0.7449395893096924
        ], 
        [
            0.74196160783767695
        ], 
        [
            0.74232019329071042
        ], 
        [
            0.73188015866279599
        ], 
        [
            0.73666876702308659
        ], 
        [
            0.73453333282470701
        ], 
        [
            0.72725769739151003
        ], 
        [
            0.7392888763427734
        ], 
        [
            0.71864514169692995
        ], 
        [
            0.72531389327049256
        ], 
        [
            0.71505629968643192
        ], 
        [
            0.71817888488769532
        ], 
        [
            0.72044927330017094
        ], 
        [
            0.7206874160766602
        ], 
        [
            0.71446274762153628
        ], 
        [
            0.72214665622711183
        ], 
        [
            0.72108065071105953
        ], 
        [
            0.73138142547607421
        ], 
        [
            0.71625962948799138
        ], 
        [
            0.72399523983001712
        ], 
        [
            0.72874577102661131
        ], 
        [
            0.72562314929962157
        ], 
        [
            0.73517947635650638
        ], 
        [
            0.74520905179977415
        ], 
        [
            0.73893547534942627
        ], 
        [
            0.74079247484207156
        ], 
        [
            0.75792009201049804
        ], 
        [
            0.75366663608551021
        ], 
        [
            0.75701102628707884
        ], 
        [
            0.75850417356491084
        ], 
        [
            0.75305046758651728
        ], 
        [
            0.76514970874786381
        ], 
        [
            0.78092472009658809
        ], 
        [
            0.77093355436325073
        ], 
        [
            0.80446006488800048
        ], 
        [
            0.80752591409683228
        ], 
        [
            0.80809775018692021
        ], 
        [
            0.79241958312988281
        ], 
        [
            0.81091059083938599
        ], 
